xffxxf/myir-optee/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
/*
 * Allocate all tables that may be needed. An optimized implementation would
 * allocate a single piece of memory and set the pointers accordingly.
 * */
static void allocate_global_resources(struct scpfw_config *cfg)
{
    struct mod_scmi_reset_domain_config *scmi_reset_config __maybe_unused;
    struct mod_scmi_voltd_config *scmi_voltd_config __maybe_unused;
    struct mod_scmi_clock_config *scmi_clock_config __maybe_unused;
    /* @cfg does not consider agent #0 this the reserved platform/server agent */
    size_t __maybe_unused scmi_agent_count = cfg->agent_count + 1;

#ifdef CFG_SCPFW_MOD_SCMI_CLOCK
    /* SCMI clock domains resources */
    scmi_clk_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                       sizeof(*scmi_clk_agent_tbl));
    scmi_clock_config = (void *)config_scmi_clock.data;
    scmi_clock_config->agent_table = scmi_clk_agent_tbl;
    scmi_clock_config->agent_count = scmi_agent_count;
#endif

#ifdef CFG_SCPFW_MOD_CLOCK
    /* Clock domains resources */
    optee_clock_cfg = fwk_mm_calloc(scpfw_resource_counter.clock_count,
                                    sizeof(*optee_clock_cfg));
    optee_clock_elt = fwk_mm_calloc(scpfw_resource_counter.clock_count + 1,
                                    sizeof(*optee_clock_elt));

    clock_data = fwk_mm_calloc(scpfw_resource_counter.clock_count,
                               sizeof(*clock_data));
    clock_elt = fwk_mm_calloc(scpfw_resource_counter.clock_count + 1,
                              sizeof(*clock_elt));
#endif

#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
    /* SCMI reset domains resources */
    scmi_reset_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                         sizeof(*scmi_reset_agent_tbl));
    scmi_reset_config = (void *)config_scmi_reset_domain.data;
    scmi_reset_config->agent_table = scmi_reset_agent_tbl;
    scmi_reset_config->agent_count = scmi_agent_count;

    optee_reset_data = fwk_mm_calloc(scpfw_resource_counter.reset_count,
                                     sizeof(*optee_reset_data));
    optee_reset_elt = fwk_mm_calloc(scpfw_resource_counter.reset_count + 1,
                                    sizeof(*optee_reset_elt));

    reset_data = fwk_mm_calloc(scpfw_resource_counter.reset_count,
                               sizeof(*reset_data));
    reset_elt = fwk_mm_calloc(scpfw_resource_counter.reset_count + 1,
                              sizeof(*reset_elt));
#endif

#ifdef CFG_SCPFW_MOD_DVFS
    /* PSU and related optee PSU regulator resources */
    psu_optee_regu_elt = fwk_mm_calloc(scpfw_resource_counter.dvfs_count + 1,
                                  sizeof(*psu_optee_regu_elt));
    psu_optee_regu_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                                  sizeof(*psu_optee_regu_data));

    psu_elt = fwk_mm_calloc(scpfw_resource_counter.psu_count + 1,
                            sizeof(*psu_elt));
    psu_data = fwk_mm_calloc(scpfw_resource_counter.psu_count,
                             sizeof(*psu_data));

    /* DVFS and SCMI performance management resources */
    dvfs_elt = fwk_mm_calloc(scpfw_resource_counter.dvfs_count + 1,
                             sizeof(*dvfs_elt));
    dvfs_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                              sizeof(*dvfs_data));

    scmi_perf_domain_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                                          sizeof(*scmi_perf_domain_data));
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
    /* SCMI voltage domains resources */
    scmi_voltd_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                         sizeof(*scmi_voltd_agent_tbl));
    scmi_voltd_config = (void *)config_scmi_voltage_domain.data;
    scmi_voltd_config->agent_table = scmi_voltd_agent_tbl;
    scmi_voltd_config->agent_count = scmi_agent_count;

    optee_regu_data = fwk_mm_calloc(scpfw_resource_counter.regu_count,
                                    sizeof(*optee_regu_data));
    optee_regu_elt = fwk_mm_calloc(scpfw_resource_counter.regu_count + 1,
                                    sizeof(*optee_regu_elt));

    voltd_data = fwk_mm_calloc(scpfw_resource_counter.regu_count,
                               sizeof(*voltd_data));
    voltd_elt = fwk_mm_calloc(scpfw_resource_counter.regu_count + 1,
                              sizeof(*voltd_elt));
#endif
}

static void set_scmi_comm_resources(struct scpfw_config *cfg)
{
    unsigned int channel_index = 0;
    size_t i, j;
    /* @cfg does not consider agent #0 this the reserved platform/server agent */
    size_t scmi_agent_count = cfg->agent_count + 1;

    scmi_agent_table = fwk_mm_calloc(scmi_agent_count,
                                     sizeof(*scmi_agent_table));

    scmi_service_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                     sizeof(*scmi_service_elt));

    msg_smt_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                sizeof(*msg_smt_elt));
    msg_smt_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                 sizeof(*msg_smt_data));

    optee_mbx_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                  sizeof(*optee_mbx_elt));
    optee_mbx_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                   sizeof(*optee_mbx_data));

    /* Set now the uniqnue scmi module instance configuration data */
    scmi_data = (struct mod_scmi_config){
        .agent_table = scmi_agent_table,
        .agent_count = scmi_agent_count,
        .protocol_count_max = 9,
        .vendor_identifier = "STMicroelectronics",
        .sub_vendor_identifier = "STMicroelectronics",
    };

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;
        size_t agent_index = agent_cfg->agent_id;

        scmi_agent_table[agent_index].type = SCMI_AGENT_TYPE_OSPM;
        scmi_agent_table[agent_index].name = agent_cfg->name;

