xffxxf/myir-optee/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
        for (j = 0; j < agent_cfg->channel_count; j++) {
            struct scpfw_channel_config *channel_cfg = agent_cfg->channel_config + j;
            struct mod_scmi_service_config *service_data;

            service_data = fwk_mm_calloc(1, sizeof(*service_data));
            *service_data = (struct mod_scmi_service_config){
                .transport_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT,
                                                              channel_index),
                .transport_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                                              MOD_MSG_SMT_API_IDX_SCMI_TRANSPORT),
                .scmi_agent_id = agent_cfg->agent_id,
                .scmi_p2a_id = FWK_ID_NONE_INIT,
            };

            /* Currently expect 1 agent with ID SCMI_AGENT_ID_NSEC0 (1) */
            fwk_assert(service_data->scmi_agent_id == SCMI_AGENT_ID_NSEC0);

            scmi_service_elt[channel_index].name = channel_cfg->name;
            scmi_service_elt[channel_index].data = service_data;

            msg_smt_elt[channel_index].name = channel_cfg->name;
            msg_smt_elt[channel_index].data = (void *)(msg_smt_data + channel_index);

            msg_smt_data[channel_index] = (struct mod_msg_smt_channel_config){
                .type = MOD_MSG_SMT_CHANNEL_TYPE_REQUESTER,
                .mailbox_size = 128,
                .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_MBX,
                                                           channel_index),
                .driver_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_MBX, 0),
            };

            optee_mbx_elt[channel_index].name = channel_cfg->name;
            optee_mbx_elt[channel_index].data = (void *)(optee_mbx_data + channel_index);

            optee_mbx_data[channel_index] = (struct mod_optee_mbx_channel_config){
                .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT, channel_index),
                .driver_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                                           MOD_MSG_SMT_API_IDX_DRIVER_INPUT),
            };

            channel_index++;
        }
    }
};

static void set_resources(struct scpfw_config *cfg)
{
    size_t i, j, k __maybe_unused, l __maybe_unused;

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;
        size_t agent_index = i + 1;

        if (agent_index != agent_cfg->agent_id) {
            panic("scpfw config expects agent ID is agent index");
        }

        for (j = 0; j < agent_cfg->channel_count; j++) {
            struct scpfw_channel_config *channel_cfg = agent_cfg->channel_config + j;

#ifdef CFG_SCPFW_MOD_SCMI_CLOCK
            /* Add first SCMI clock. We will add later the clocks used for DVFS */
            if (channel_cfg->clock_count) {
                size_t clock_index = scpfw_resource_counter.clock_index;
                struct mod_scmi_clock_device *dev = NULL;

                /* Set SCMI clocks array for the SCMI agent */
                dev = fwk_mm_calloc(channel_cfg->clock_count,
                                    sizeof(struct mod_scmi_clock_device));

                fwk_assert(!scmi_clk_agent_tbl[agent_index].device_table);
                scmi_clk_agent_tbl[agent_index].device_count = channel_cfg->clock_count;
                scmi_clk_agent_tbl[agent_index].device_table = dev;

                /* Set clock and optee/clock elements and config data */
                for (k = 0; k < channel_cfg->clock_count; k++) {
                    struct scmi_clock *clock_cfg = channel_cfg->clock + k;

                    dev[k].element_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_CLOCK, clock_index);

                    optee_clock_cfg[clock_index].clk = clock_cfg->clk;
                    optee_clock_cfg[clock_index].default_enabled = clock_cfg->enabled;

                    optee_clock_elt[clock_index].name = clock_cfg->name;
                    optee_clock_elt[clock_index].data = (void *)(optee_clock_cfg + clock_index);

                    clock_data[clock_index] = (struct mod_clock_dev_config){
                        .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                                   clock_index),
                        .api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                            0),
                        .pd_source_id = FWK_ID_NONE,
                    };

                    clock_elt[clock_index].name = clock_cfg->name;
                    clock_elt[clock_index].data = (void *)(clock_data + clock_index);

                    clock_index++;
                }

                scpfw_resource_counter.clock_index = clock_index;
            }
#endif

#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
            if (channel_cfg->reset_count) {
                struct mod_scmi_reset_domain_device *dev = NULL;
                size_t reset_index = scpfw_resource_counter.reset_index;

                /* Set SCMI reset domains array for the SCMI agent */
                dev = fwk_mm_calloc(channel_cfg->reset_count, sizeof(*dev));

                fwk_assert(!scmi_reset_agent_tbl[agent_index].device_table);
                scmi_reset_agent_tbl[agent_index].agent_domain_count = channel_cfg->reset_count;
                scmi_reset_agent_tbl[agent_index].device_table = dev;

                /* Set reset_domain and optee/reset elements and config data */
                for (k = 0; k < channel_cfg->reset_count; k++) {
                    struct scmi_reset *reset_cfg = channel_cfg->reset + k;

                    dev[k].element_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_RESET_DOMAIN,
                                                      reset_index);

                    optee_reset_data[reset_index].rstctrl = reset_cfg->rstctrl;

