xffxxf/myir-optee/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
                    /* Module psu_optee module (elements and  configuration data) */
                    psu_optee_regu_elt[psu_index].name = perfd_cfg->regulator->reg_name;
                    psu_optee_regu_elt[psu_index].sub_element_count = scpfw_resource_counter.psu_count;
                    psu_optee_regu_elt[psu_index].data = (void *)(psu_optee_regu_data + psu_index);

                    psu_optee_regu_data[psu_index].regulator = perfd_cfg->regulator;

                    /* Module psu (elements and  configuration data) */
                    psu_elt[psu_index].name = regulator_name(perfd_cfg->regulator);
                    psu_elt[psu_index].data = (void *)(psu_data + psu_index);
                    psu_data[psu_index].driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, psu_index);
                    psu_data[psu_index].driver_api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, 0);

                    /* Module clock and optee_clock */
                    fwk_assert(!clock_elt[clock_index].data);

                    clock_elt[clock_index].name = perfd_cfg->clk->name;
                    clock_elt[clock_index].data = (void *)(clock_data + clock_index);

                    clock_data[clock_index] = (struct mod_clock_dev_config){
                        .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                                   clock_index),
                        .api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                            0),
                        .pd_source_id = FWK_ID_NONE,
                    };

                    optee_clock_cfg[clock_index].clk = perfd_cfg->clk;
                    optee_clock_cfg[clock_index].default_enabled = false;

                    optee_clock_elt[clock_index].name = perfd_cfg->clk->name;
                    optee_clock_elt[clock_index].data = (void *)(optee_clock_cfg + clock_index);

                    clock_index++;
                    psu_index++;
                    dvfs_index++;
                }

                scpfw_resource_counter.clock_index = clock_index;
                scpfw_resource_counter.psu_index = psu_index;
                scpfw_resource_counter.dvfs_index = dvfs_index;
            }
#endif
        }
    }
}

void scpfw_configure(struct scpfw_config *cfg)
{
    count_resources(cfg);
    allocate_global_resources(cfg);
    set_scmi_comm_resources(cfg);
    set_resources(cfg);
}
